{"Formations": [{"titre": "ESC Pau Business school Grade de Master MSc: Management of Information Technology and Digitalization", "date": "01/2023", "établissement": "ESC Pau Business school", "description": ""}, {"titre": "Université Paris Dauphine Master: Finance", "date": "2011", "établissement": "Université Paris Dauphine", "description": ""}, {"titre": "Université Panthéon Assas Master 2 Techniques Financières et Bancaires (Paris II)", "date": "2009", "établissement": "Université Panthéon Assas", "description": ""}, {"titre": "Université de Pau et des Pays Master 2 Management et Administration des Entreprises de l'Adour, Institut (MBA) d'Administration des Entreprises (IAE) – Pau", "date": "2008", "établissement": "Université de Pau et des Pays", "description": ""}, {"titre": "ESC Rouen Finance Internationale et Management", "date": "2004", "établissement": "ESC Rouen", "description": ""}, {"titre": "Université d’État du Management, Institut du Management de la Finance", "date": "2001 - 2006", "établissement": "Université d’État du Management", "description": ""}, {"titre": "Lycée Supérieur (Moscou), Section économique et mathématique", "date": "2001", "établissement": "Lycée Supérieur (Moscou)", "description": ""}], "Compétences": {"langage": "VBA, DAX, Python, SQL", "framework": "SimCorp Dimension, SAP, BO Power BI, Crystal reports", "base de données": "SQL, ETL", "logiciels": "JIRA, ServiceNow", "librairie": "Bloomberg Market Concepts (BMC)", "bibliothèque": "Bloomberg Corporate Finance Institut", "système d'exploitation": "Windows, Linux", "serveur d'application": "Zabbix, Dynatrace, TrueSight, Centreon", "indicateurs métiers": "Performance Measurement et Attribution, Risk Management, Corporate action, Bank Transaction and Operations, Comptabilité", "produits financiers": "Connaissance des produits financiers industriels et bancaires, Market data, Portfolio Management (Equity, Fixed Income, Derivatives et Alternative Investments)", "fonctionnel": "Project management & IT, Gestion de Projet", "réglementation": "MIF, Solvabilité II, IFRS, GAAP", "outils dataviz": "Power BI Desktop", "autres outils": "Bloomberg LP, CFPB-Ecole supérieure de la banque", "méthodologie": "Agile, Scrum"}, "Certifications": [{"nom": "", "date": ""}], "Nom": "XX", "Prénom": "Consultant", "Expériences professionnelles": [{"nom de l'entreprise": "La Banque Postale, Inetum", "nom du poste occupé": "Chef de Projet Scrum Master", "durée": "05/2023- En cours", "description": "Sous gestion : 2 équipes, Event production (Développeurs, Architect et TechLead :10 personnes) Htool (Experts Dynatrace/ développeurs : 2 personnes)\nFonctionnel : Management de projet Agile IT &Delivery Leadership, pilotage, cadrage et planification\nPerformance de produit, supervision de stratégie, la mise en œuvre et l'optimisation des produits (Zabbix, Dynatrace) Développement de tableaux de bord et validation des tests Application des principes et des pratiques agiles Suivi de la réalisation de la livraison des projets, programmes et portefeuilles, vélocité, capacité des équipes Mise en place des pratiques d’auto-inspection et d’amélioration continue Participation à la résolution des obstacles rencontrés par l’équipe Préparation et animation les cérémonies agiles (Daily, Affinage, Retro, Sprint planning, Review, Delivery mensuel, PI planning, club utilisateurs et collecte des retours clients) Contrôle et la gouvernance : atteindre la performance et l'alignement entre une organisation, le responsable Tribu, les utilisateurs et les objectifs stratégiques de l'équipe Management vertical et horizontal à travers une organisation, définition, explication, mise en œuvre, révision continue des meilleures pratiques et des nouvelles techniques", "environnement technique": "Zabbix, Dynatrace, TrueSight, Centreon", "méthodologie": ""}, {"nom de l'entreprise": "TotalEnergies", "nom du poste occupé": "Data Analyst", "durée": "08/2021 - 01/2023", "description": "Projet: One Tech (expertise technique et scientifique). Méthodes et optimisation des opérations Projet: Reporting simplification et migration de data\nProject management, étude de besoin, rédaction de cahier de charges, planification, cadrage, intégration de data, testing and control, analyse des risques, amélioration des applications. Modernisation et simplification des outils (SAP, Power BI, Excel, WIBI). Database requêtage Data extraction and reporting automation Excel VBA programmation, SAP BO. Data modelling, analyse et control de qualité: EP & GRP produits et and services, filiales, analyse des variation de prix, Bilan, P&L Top management reporting, Monitoring de facturation DEFI et non DEFI, analyse PAR database, Interco, RAS, RFS, AG, Expat, CATS, OTC, At cost, Encours client (Situation FBL5N, Graphiques de suivi). Analyse de variations produites CA. Relance client et mise à jour des contacts automatisé Cartographie. Analyse de code clients et mise à jour de base clients SAP", "environnement technique": "", "méthodologie": ""}], "Projets": [{"titre": "", "date": "", "description": ""}], "Langues": [{"nom": "Français", "niveau": "Native"}]}