{"Formations": [{"titre": "Certificat .Net Application Security", "date": "2020", "établissement": "CODEBASHING LTD", "description": ""}, {"titre": "Certificat Leading SAFe 4 Agilist", "date": "2019", "établissement": "Scaled Agile, Inc.", "description": ""}, {"titre": "Certificat Agile SCRUM", "date": "2018", "établissement": "", "description": ""}, {"titre": "Formations ASP.Net MVC 4 et C# Avancée", "date": "2017", "établissement": "Global Knowledge", "description": ""}, {"titre": "Doctorat en Informatique Fondamentale", "date": "2014", "établissement": "LIFL Univ. Lille I", "description": ""}, {"titre": "Master en Informatique et Télécommunications", "date": "2011", "établissement": "INP ENSEEIHT Univ. Toulouse III", "description": ""}, {"titre": "Maîtrise en Informatique et Réseaux Informatiques", "date": "2010", "établissement": "ENIS Univ. Sfax-Tunisie", "description": ""}, {"titre": "Baccalauréat scientifique - Mention Très Bien", "date": "2005", "établissement": "Lycée Hedi Soussi Sfax-Tunisie", "description": ""}], "Expériences professionnelles": [{"nom de l'entreprise": "ARDIAN", "nom du poste occupé": "Développeur Full Stack / SCRUM Master", "date": "2 ans : 2021 / 2023", "description": "Projet de migration : KATE application web dédiée au suivi des entreprises investies et de leurs performances sur le périmètre Fonds Direct (MidCap, Expansion, Infrastructure, Co-Investissement).\n\nDéveloppement Frontend : Migration de AngularJS vers Angular 15, Développement de nouvelles IHM avec TypeScript, Immer, RxJs / Component Store / BootStrap / Ag-Grid / Angular Material.\n\nDéveloppement Backend : Migration de .Net 4.7 vers .Net 6.0, Modèle CQRS (Command and Query Responsibility Segregation), Approche Domain-Driven Design (Architecture en Oignon)-Mediator, Développement de test Unitaire (NUnit / Mock).\n\nDéveloppement SQL : Procédures stockés et Vues (Curseur / Jointure / Scripts..), Création de nouvelles tables.\n\nPower Bi : Création et intégration de rapports paginés, Modélisation et création de DataSets.\n\nSCRUM Master : Animation des cérémonies (sprint planning, daily meeting, retro), Suivie des actions convenues lors de la retro, Suivie et MAJ du sprint board.", "environnement technique": "C#, .Net 6.0 (core), .Net Standard, Entity Framework, JavaScript, TypeScript, SQL, Immer, RxJs, Component Store, BootStrap, Ag-Grid, Angular Material, Yarn, Npm, Matomo, Sentry, AutoMapper, Fluent Validation, Aspose, Dapper, Swagger, PowerBi, SSRS, Azure Data Studio, SourceTree, GIT, VS Code, VS Studio 2022, SQL SMS 19"}, {"nom de l'entreprise": "IT-CE Groupe BPCE-IT", "nom du poste occupé": "Lead Dev / SCRUM Master", "date": "3 ans : 2018 / 2021", "description": "Projet CE Net Abonnement (Offre groupée Caisse d’Epargne) : Gestion des comptes et flux des clients professionnels.\n\nDéveloppement des IHM et services web avec HTML, CSS, JavaScript, JQuery, Entity Framework, T-SQL, API SOAP.\n\nProjet Liasse Fiscale DRC (Dossier Réglementaire Client) : Gestion électronique et archivage de données.\n\nPilotage du projet, Mise en place de l’architecture technique, Coordination entre les différentes équipes, Développement de Batch en Multithreading, Etudes d'impacts, Validation des livrables et spécifications techniques, Création de scénario et suivie de test, Déploiement et suivie de production.", "environnement technique": "C#, .Net, ASP.Net, Framework 4.5, Visual studio 2019, Spring .Net, HTML, CSS, JavaScript, JQuery, Entity Framework, T-SQL, API SOAP, SQL Server 2012, Pacbase, Microsoft VISIO, Jira, Confluence, HP QC, GCEDOC, Synergy, TFS, XL Release, XL Deploy"}, {"nom de l'entreprise": "Orange", "nom du poste occupé": "Développeur / Responsable méthodes et process", "date": "3 ans : 2015 / 2018", "description": "Développement Robots ATS ; Automates de Test de Services pour le contrôle continu de la QoS :\n\nEtude et spécifications techniques, Développement d’automates de test avec Selenium et Appium, Développement d’API Web, Modélisation et contrôle de la conformité des processus, Elaboration et évaluation de scenarii de tests.\n\nProjet ENDURANCE : Mise en place pour PEM de deux bancs d’endurance box Raspberry PI dans le cadre du projet QS Box.\n\nDéveloppement d’automate de teste de téléchargement P2P en multithreading avec le protocole BitTorrent.\n\nFormation, support et maintenance.\n\nProjet PFA : Plan de fin d’année ARCEP 2016. Mise en place d’un dispositif de tests d’envoi de SMS pour la nuit du 31 Décembre.", "environnement technique": "C#.Net, Framework 3.5, Visual studio 2015, PL-SQL, API REST, SQL Developer, SVN, Appium server, Selenium, vSphere Client, WinSCP, ATCommand, Raspberry PI, Modem Huawei"}, {"nom de l'entreprise": "CDI Technologies", "nom du poste occupé": "Développeur / Doctorant", "date": "3 ans : 2012 / 2015", "description": "Référent technique du produit KeaPolaris : Logiciel de dessin assisté par ordinateur (CAO/DAO).\n\nRétro- ingénierie et développement de ligne de produit, Maintenance évolutive et tests de validation.\n\nElaboration des cahiers de charges et spécifications technique, Développement de modules graphiques, interfaçage AutoCAD.\n\nProjet SERVEAU : Logiciel de simulation et d’aide à la décision pour la réduction de la Vulnérabilité énergétique des aménagements urbains.\n\nSpécification fonctionnelle, Elaboration des diagrammes UML, Gestion des réseaux LAN/VPN et virtualisation, Administration et MAJ du site web http://www.cditech.fr.\n\nRédaction d’articles scientifique : « Application de l’IDM pour la modernisation et la migration d’application existante » Conférence INFORSID Lyon 2014.", "environnement technique": "C#.Net, Framework 3.0, Visual studio 2013, WCF, Microsoft Access, Power AMC, Turtoise SVN, AraxisMerge, Active Directory, Windows Server 2008, FileZilla, DropBox"}, {"nom de l'entreprise": "LAAS CNRS", "nom du poste occupé": "Stagiaire chercheur / Développeur", "date": "6 mois : 2011", "description": "Recherche sur la reconnaissance des différents états d’un réseau LAN TCP/IP.\n\nDéveloppement d’un algorithme d’apprentissage, Rédaction d’un article journal en anglais (Ref : Global Information Infrastructure and Networking Symposium (GIIS) 2012 du 17 décembre au 19 décembre 2012, Choroni (Venezuela), Décembre 2012, 6p.)", "environnement technique": "C++, Perl, Visual Studio 2010, Network Simulator 2"}, {"nom de l'entreprise": "Média Center", "nom du poste occupé": "Stagiaire développeur / PFE", "date": "1 an : 2009 / 2010", "description": "Analyse des besoins, conception et développement du logiciel Parc-Info.\n\nApplication distribuée de gestion et d’administration d’un parc informatique.\n\nDéveloppement de module d’authentification client/serveur, Développement de module d’accès et contrôle distant.\n\nInstallation, formation utilisateurs et rédaction d’un manuel d’utilisation.", "environnement technique": "C#.Net, Framework 2.0, Visual Studio 2008, Remoting.Net, SQL Server 2005, Telerik, SVN, PacestarUML, FTP, SNMP"}], "Compétences techniques": {"Langages de programmation": "C#, .Net 6.0 (core), TypeScript, JavaScript, SQL, HTML, CSS, JQuery, T-SQL, PL-SQL, C++, Perl, VB", "Framework": ".Net Standard, Entity Framework, Angular, AngularJS, Immer, RxJs, Component Store, BootStrap, Ag-Grid, Angular Material, NGRX store, AutoMapper, Fluent Validation, PowerBi, SSRS, Aspose, Dapper, Swagger, Power BI", "Base de données": "Microsoft SQL Server, MySQL, Oracle, DB2, Access", "Logiciels": "Visual Studio, Visual Code, SSMS, SVN, TFS, GIT, Jira, Confluence, AZURE DevOps, SourceTree, VS Code, VS Studio 2022, SQL SMS 19, IT-CE Groupe BPCE-IT, XL Release, XL Deploy, Microsoft VISIO, Jira, Confluence, HP QC, GCEDOC, Synergy, Install-it, Pack-it, AraxisMerge, Active Directory, Windows Server 2008, FileZilla, DropBox, vSphere Client, WinSCP, ATCommand, Appium server, Selenium, Turtoise SVN, Network Simulator 2, Visual Studio 2010, Remoting.Net, SQL Server 2005, Telerik, PacestarUML, FTP, SNMP", "Librairie": "TypeScript, RxJs, Component Store, BootStrap, Ag-Grid, Angular Material, NGRX store, AutoMapper, Fluent Validation, PowerBi, SSRS, Aspose, Dapper, Swagger, Power BI", "Bibliothèque": "Immer, RxJs, Component Store, BootStrap, Ag-Grid, Angular Material, NGRX store, AutoMapper, Fluent Validation, PowerBi, SSRS, Aspose, Dapper, Swagger, Power BI", "Système d'exploitation": "Windows, Linux", "Serveur d'application": "Azure DevOps, IIS", "Outils dataviz": "PowerBi, SSRS, Azure Data Studio", "Méthodologie": "Agile SCRUM, Scaled Agile SAFE, Cycle en V", "API Design": "Swagger, Power BI", "Cloud Computing": "Azure DevOps", "Devops": "Azure DevOps, GIT, SVN, TFS, Jira, Confluence, XL Release, XL Deploy", "Autres outils": "Visual Studio, Visual Code, SSMS, SVN, TFS, GIT, Jira, Confluence, AZURE DevOps, SourceTree, VS Code, VS Studio 2022, SQL SMS 19, IT-CE Groupe BPCE-IT, XL Release, XL Deploy, Microsoft VISIO, Jira, Confluence, HP QC, GCEDOC, Synergy, Install-it, Pack-it, AraxisMerge, Active Directory, Windows Server 2008, FileZilla, DropBox, vSphere Client, WinSCP, ATCommand, Appium server, Selenium, Turtoise SVN, Network Simulator 2, Visual Studio 2010, Remoting.Net, SQL Server 2005, Telerik, PacestarUML, FTP, SNMP"}, "Compétences fonctionnelles": {"Processus métiers bancaires": "Gestion des comptes et flux des clients professionnels, Gestion électronique et archivage de données, Intégration des nouvelles rubriques de saisies des bilans", "Interlocuteurs privilégiés": "Equipes de développement, Equipes métiers, Clients", "Périmètre fonctionnel": "Migration d'application, Gestion de projet, Business Intelligence, Développement d'automates de test, Modélisation et contrôle de la conformité des processus, Elaboration et évaluation de scenarii de tests, Formation, support et maintenance, Rédaction des cahiers de charges et spécifications technique, Elaboration des diagrammes UML, Gestion des réseaux LAN/VPN et virtualisation, Administration et MAJ du site web"}, "Certifications": [{"nom": "Certificat .Net Application Security", "date": "2020"}, {"nom": "Certificat Leading SAFe 4 Agilist", "date": "2019"}, {"nom": "Certificat Agile SCRUM", "date": "2018"}], "Langues": [{"nom": "Anglais", "niveau": "Bonne maîtrise"}, {"nom": "Arabe", "niveau": "Bilingue"}, {"nom": "Français", "niveau": "Bilingue"}]}