{"Formations": [{"titre": "Master 2 « Systèmes d’information & Réseaux »", "date": "2007", "établissement": "Université François Rabelais, Tours", "description": ""}], "Expériences professionnelles": [{"nom de l'entreprise": "SGCIB (Société Générale Corporate and Investment Banking)", "nom du poste occupé": "Consultant JAVA Finance", "date": "09/2021 - Ce jour", "description": "Au sein du service GPM de la SGCIB, architecture, conception, développement, support niveau 3 de l’application SR (Système de Règlement) qui gère les payements de la banque.", "environnement technique": "JAVA 8 ET 11, SPRING 5, SPRING BOOT 2, LOMBOK, JAXB, MICROSERVICES(REST), JACKSON, MOCKITO, LOGBACK, SLF4J, JUNIT 5, SONAR, NEXUS, INTELLIJ, GIT, GITHUB, JIRA, MAVEN, SWAGGER, POSTMAN, ORACLE, SWIFT, SYBERARK, UNIX, WINDOWS 10"}, {"nom de l'entreprise": "BNP PARIBAS CIB", "nom du poste occupé": "Consultant JAVA Finance", "date": "11/2019 - 08/2021", "description": "Au sein de BNP CIB, conception, développement de l’application Spreadauto qui permet d’analyser automatiquement les rapports financiers sur les entreprises demandeurs de crédit. Coordination, suivi et expertise technique sur l’application FXPLUS qui gère le payement et les échanges de monnaies", "environnement technique": "JAVA 8, SPRING 5, SPRING BOOT 2, LOMBOK, JAXB, MICROSERVICES(REST), AWS(S3), OCR(ABBYY), ANSIBLE, LIQUIBASE, JACKSON, MODELMAPPER, MOCKITO, MOCKSERVER, LOGBACK, SLF4J, ITEXT, APCHE-POI, JUNIT 5, SONAR, NEXUS, INTELLIJ, GIT, BITBUCKET, JIRA, MAVEN, SWAGGER, POSTMAN, ORACLE, UNIX, WINDOWS 10"}, {"nom de l'entreprise": "Malakoff Mederic", "nom du poste occupé": "Consultant JAVA Assurance", "date": "10/2018 à 10/2019", "description": "Au sein de la direction des systèmes d’informations, conception, développement de l’application PCPME qui est le portail Malakoff Mederic pour les entreprises.", "environnement technique": "JAVA 8, 11 ET 12, SPRING 5, SPRING BOOT 2, SPRING WEBFLUX, LOMBOK, JAXB, MICROSERVICES(REST, SOAP), CXF, GUAVA, JACKSON, MODELMAPPER, MOCKITO, MOCKSERVER, LOGBACK, SLF4J, DOM4J, JUNIT 5, SONAR, NEXUS, INTELLIJ, GIT, BITBUCKET, JIRA, MAVEN, SWAGGER, SOAPUI, POSTMAN, MONGODB, ROBO3T, ACTIVEMQ, MOM, NETTY, EUREKA, DOCKER, UNIX, WINDOWS 10"}, {"nom de l'entreprise": "CACIB(Crédit Agricole Corporate Investment Bank)", "nom du poste occupé": "Consultant JAVA Finance", "date": "07/2017 à 10/2018", "description": "Au sein du service Solution Factory de CACIB, conception, développements, Support niveau 3 des applications MEMPHIS, ISAAC, CAESIGN, GVAL, PAPYRUS et ARGOS.", "environnement technique": "JAVA, SPRING, SPRING BATCH, HIBERNATE, JAXB, SERVICE WEB (JERSEY), LOGBACK, SLF4J, DOM4J, JUNIT, ECLIPSE, SVN, SONAR, NEXUS, JENKINS, MAVEN, ORACLE, SYBASE, EXCEL"}, {"nom de l'entreprise": "HSBC (Hong Kong and Shanghai Banking Corporation)", "nom du poste occupé": "Consultant JAVA FIX Finance", "date": "08/2015 à 05/2017", "description": "Au sein du service EQUITY DERIVATIVE de HSBC, conception, développements, support de niveau 3 de l’application ECOMMERCE qui permet de faire la cotation des produits dérivées d’actions.", "environnement technique": "JAVA, SPRING, SPRING DATA, SPRING SECURITY, HIBERNATE, JAXB, LOMBOK, GUAVA, DOZER, DROOLS, HAZELCAST, SERVICE WEB (CXF, SOAPUI), SLF4J, LOG4J, DOM4J, JUNIT, JBEVAVE, TEAMCITY, SONAR, NEXUS, ECLIPSE, SVN, MAVEN, SWAGGER, POSTMAN, ORACLE, UNIX, WINDOWS 7, FIX 4.4"}, {"nom de l'entreprise": "CACEIS", "nom du poste occupé": "Consultant JAVA Finance", "date": "03/2015 à 06/2015", "description": "Au sein du service DSI de CACEIS, conception, développements du projet Newport permettant l’intégration des contrôles mandat au portail CACEIS.", "environnement technique": "JAVA, SPRING, SPRING BATCH, HIBERNATE, JAXB, SERVICE WEB, LOG4J, JUNIT, RAD, RTC, SONAR, JENKINS, MAVEN, ANT, ORACLE, SYBASE, EXCEL"}, {"nom de l'entreprise": "SGCIB (Société Générale Corporate and Investment Banking)", "nom du poste occupé": "Consultant JAVA Finance", "date": "06/2013 à 01/2015", "description": "Au sein du service ITEC de la SGCIB, conception, développements, support niveau 3 de l’application ODYSSEY qui permet de faire le calcul et le partage de marges de l’activité commerciale de la Banque.", "environnement technique": "JAVA, SPRING, SPRING BATCH, HIBERNATE, JAXB, SERVICE WEB, TMON (MONITORING), TIBCO RDV, LOG4J, DOM4J, JUNIT, ECLIPSE, SVN, SONAR, NEXUS, JENKINS, MAVEN, ORACLE, SYBASE, BUSINESS OBJECTS, MYREPORT"}, {"nom de l'entreprise": "DOCAPOSTE DPS", "nom du poste occupé": "Ingénieur d’étude et développement JAVA", "date": "07/2009 – 06/2013", "description": "Conception et réalisation du suivi de courrier (01/2013 – 06/2013)", "environnement technique": "JAVA, MULTITHREADING, LOG4J, DOM4J, JUNIT, SHELL, UML, ECLIPSE, SVN, MYSQL, LINUX, AIX, WINDOWS 7"}, {"nom de l'entreprise": "DOCAPOSTE DPS", "nom du poste occupé": "Ingénieur d’étude et développement JAVA", "date": "07/2012 – 12/2012", "description": "Conception et réalisation d’un module de traitement Multi flux", "environnement technique": "JAVA, MULTITHREADING, HIBERNATE, JBPM, LOG4J, DOM4J, JUNIT, SHELL, UML, ECLIPSE, SVN, MYSQL, LINUX, AIX, WINDOWS 7"}, {"nom de l'entreprise": "DOCAPOSTE DPS", "nom du poste occupé": "Ingénieur d’étude et développement JAVA", "date": "08/2011 – 06/2012", "description": "Conception et réalisation d’un module de traitement PDF", "environnement technique": "JAVA, MULTITHREADING, HIBERNATE, JBPM, LOG4J, DOM4J, ITEXT JUNIT, SHELL, UML, ECLIPSE, SVN, MYSQL, LINUX, AIX, WINDOWS 7"}, {"nom de l'entreprise": "DOCAPOSTE DPS", "nom du poste occupé": "Ingénieur d’étude et développement JAVA", "date": "12/2010 – 07/2011", "description": "Conception et réalisation d’un moteur de tri", "environnement technique": "JAVA, MULTITHREADING, HIBERNATE, JBPM, LOG4J, DOM4J, JUNIT, SHELL, UML, ECLIPSE, SVN, MYSQL, LINUX, AIX, WINDOWSXP, WINDOWS 7"}, {"nom de l'entreprise": "DOCAPOSTE DPS", "nom du poste occupé": "Ingénieur d’étude et développement JAVA", "date": "10/2009 – 11/2010", "description": "Conception et réalisation d’un moteur de workflow", "environnement technique": "JAVA, MULTITHREADING, HIBERNATE, JBPM, SERVICE WEB, LOG4J, DOM4J, JUNIT, SHELL, UML, ECLIPSE, SVN, MYSQL, LINUX, AIX, WINDOWSXP"}, {"nom de l'entreprise": "PSA (Peugeot Société Anonyme)", "nom du poste occupé": "Consultant JAVA", "date": "10/2007 à 06/2009", "description": "Développement d’une application de communications bancaires entre PSA et ses partenaires : fournisseurs, clients, filiales et banque.", "environnement technique": "JAVA, APPLET, SWING, OJB, STRUTS, LEGO (PSA), LOG4J, JUNIT, ITEXT, PERL, UML, ECLIPSE, MAVEN, ENTERPRISE ARCHITECT, POWER DESIGNER, CVS, SVN SUN ONE WEB SERVER, ORACLE, LDAP"}], "Compétences techniques": {"Langages de programmation": "JAVA, J2EE (EJB, JDBC, SERVLET, JSP, JMS, SERVICE WEB), PL/SQL, SQL, XML, XSL, XSLT, XSP, PHP, JAVASCRIPT, HTML, CSS, SHELL, PERL", "Framework": "SPRING, SPRING BOOT, SPRING DATA, SPRING BATCH, SPRING SECURITY, HIBERNATE, JACKSON, MODELMAPPER, MOCKITO, MOCKSERVER, TESTCONTAINERS, TOGGLZ, JAXB, LOMBOK, GUAVA, DOZER, DROOLS, HAZELCAST, SERVICE WEB (CXF, JERSEY, REST, SOAP, SOAPUI), AWS, SWAGGER, ACTIVEMQ, MOM, EUREKA, ANSIBLE, LIQUIBASE, SLF4J, LOGBACK, EJB 3, OJB, JBPM, STRUTS 2, JQUERY, DOM4J, LOG4J, JUNIT, APCHE-POI, ITEXT, FIX", "Base de données": "ORACLE, MONGODB, SYBASE, SQL SERVER, MYSQL, POSTGRESQL, DB2, ACCESS", "Logiciels": "CVS, SVN, RTC, GIT, GITHUB, BITBUCKET, MAVEN, ANT, JENKINS, DOCKER, SONAR, NEXUS, ECLIPSE, INTELLIJ, SYBERARK, JIRA, POSTMAN, SOAPUI, POSEIDON, POWER DESIGNER, ENTERPRISE ARCHITECT, BUSINESS OBJECTS, MYREPORT, EXCEL, SPOON", "Librairie": "", "Bibliothèque": "", "Système d'exploitation": "UNIX, WINDOWS 10", "Serveur d'application": "WEBSPHERE, TOMCAT, NETTY, JBOSS, SUN ONE WEB SERVER", "Outils dataviz": "", "Méthodologie": "SCRUM, UML, BDD, TDD, DDD, CI/CD, DEVOPS, ARCHITECTURES MICROSERVICES", "API Design": "", "Cloud Computing": "", "Devops": ""}, "Compétences fonctionnelles": {"Processus métiers bancaires": "ACTIVITES Process Front/Middle/Back Offices en Banque de Financement et d’Investissement", "Interlocuteurs privilégiés": "", "Périmètre fonctionnel": ""}, "Certifications": [{"nom": "Master 2 « Systèmes d’information & Réseaux » - Université François Rabelais, Tours", "date": "2007"}], "Langues": [{"nom": "ANGLAIS", "niveau": "Courant"}], "Projets": [{"titre": "Transformation des batchs de payement en microservices", "date": "09/2021 - Ce jour", "description": "Au sein du service GPM de la SGCIB, architecture, conception, développement, support niveau 3 de l’application SR (Système de Règlement) qui gère les payements de la banque."}, {"titre": "Conception et développement de l’application Spreadauto", "date": "11/2019 - 08/2021", "description": "Au sein de BNP CIB, conception, développement de l’application Spreadauto qui permet d’analyser automatiquement les rapports financiers sur les entreprises demandeurs de crédit."}, {"titre": "Conception et développement des Microservices", "date": "10/2018 à 10/2019", "description": "Au sein de la direction des systèmes d’informations, conception, développement de l’application PCPME qui est le portail Malakoff Mederic pour les entreprises."}, {"titre": "Conception et développement d’une application de supervision de Memphis", "date": "07/2017 à 10/2018", "description": "Au sein du service Solution Factory de CACIB, conception, développements, Support niveau 3 des applications MEMPHIS, ISAAC, CAESIGN, GVAL, PAPYRUS et ARGOS."}, {"titre": "Conception et développement d’un moteur de règle pour valider les paramètres de cotation", "date": "08/2015 à 05/2017", "description": "Au sein du service EQUITY DERIVATIVE de HSBC, conception, développements, support de niveau 3 de l’application ECOMMERCE qui permet de faire la cotation des produits dérivées d’actions."}, {"titre": "Intégration de la CVA à l’application Odyssey", "date": "06/2013 à 01/2015", "description": "Au sein du service ITEC de la SGCIB, conception, développements, support niveau 3 de l’application ODYSSEY qui permet de faire le calcul et le partage de marges de l’activité commerciale de la Banque."}, {"titre": "Automatisation de l’intégration des fichiers de suivi", "date": "09/2012 à 06/2013", "description": "Conception et réalisation du suivi de courrier"}, {"titre": "Prise en charge de nouveaux formats de documents dans les traitements métiers", "date": "07/2012 à 12/2012", "description": "Conception et réalisation d’un module de traitement Multi flux"}, {"titre": "Ajout du traitement des documents PDF dans les traitements métiers", "date": "08/2011 à 06/2012", "description": "Conception et réalisation d’un module de traitement PDF"}, {"titre": "Implémentation de la logique métier pour les nouveaux produits de la poste", "date": "12/2010 à 07/2011", "description": "Conception et réalisation d’un moteur de tri"}, {"titre": "Paramétrage du le pool de threads", "date": "10/2009 à 11/2010", "description": "Conception et réalisation d’un moteur de workflow"}, {"titre": "Sécuriser l’accès aux fichiers grâce à une mise en place de droits affectés en fonction de l’accréditation utilisateur", "date": "10/2007 à 06/2009", "description": "Développement d’une application de communications bancaires entre PSA et ses partenaires : fournisseurs, clients, filiales et banque."}]}